#include <stdio.h>

int main()
{
	printf("문장을 작성하는 영역");

	return 0;
}
#pragma region 필기
//1) #include <stdio.h>는 프로그램 코드 내에 C언어의 입력,출력 기능을 사용하기 위해 추가해야 하는 코드입니다.

//2) main은 함수의 이름입니다.
//   함수는 프로그램을 구성하는 구성 요소, 단위, 명령문 집합을 의미합니다.
//   C언어에서 main 함수는 프로젝트에서 기능을 작동시키기 위한 함수입니다.
//   함수의 () 부분은 해당 함수를 실행할 때 전달해줄 값을 적는 위치입니다. 현재는 따로 작성되지 않았습니다.

//3) int는 해당 함수의 데이터 형태입니다.
//   int는 C언어에서 정수(Integer)를 의미합니다.

//4) return은 함수를 종료시키는 키워드(keyword)입니다.
//   키워드는 C언어에서 지정된 특정 기능을 수행하는 영단어를 의미합니다.
//   return 다음에는 전달할 값을 작성할 수 있습니다. 이 때 전달하는 값은 함수의 데이터 형태에 따라 결정됩니다.

//5) ;(세미콜론)은 c언어에서 명령문의 마지막에 붙여주는 기호입니다.

//6) {}(블록)은 코드의 작성 범위(scope)를 표현하는 기호입니다.
#pragma endregion